[Reference](https://towardsdatascience.com/5-pandas-tricks-thatll-make-your-life-easier-e263a948dc0f)

In [2]:
import pandas as pd

df = pd.DataFrame({"col1": ["A0", "A1", "A0", "A2", "A0", "A1"]})
df

  col1
0   A0
1   A1
2   A0
3   A2
4   A0
5   A1

In [3]:
df.iloc[0].col1

'A0'

In [4]:
df.iloc[-1].col1

'A1'

In [5]:
df.loc[1, "col1"]

'A1'

In [6]:
df.iloc[0].col1 = "First"

In [7]:
df.iloc[-1].col1 = "Last"

In [8]:
df.loc[2, "col1"] = "Index"

In [11]:
new_column = list(range(len(df)))
new_column

[0, 1, 2, 3, 4, 5]

In [12]:
df.new_column1 = new_column

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

In [13]:
df["new_column2"] = new_column

In [14]:
df.loc[:, 'new_column3'] = new_column

In [15]:
df = df.assign(new_column4=new_column)

In [16]:
# This will add two columns
df.assign(new_column4=new_column, inplace=True)

    col1  new_column2  new_column3  new_column4  inplace
0  First            0            0            0     True
1     A1            1            1            1     True
2  Index            2            2            2     True
3     A2            3            3            3     True
4     A0            4            4            4     True
5   Last            5            5            5     True

In [17]:
df["col1"]

0    First
1       A1
2    Index
3       A2
4       A0
5     Last
Name: col1, dtype: object

In [18]:
df[["col1"]]

    col1
0  First
1     A1
2  Index
3     A2
4     A0
5   Last

In [19]:
type(df[["col1"]])

pandas.core.frame.DataFrame

In [21]:
df = pd.DataFrame(
    {
        "col1": ["A0", "A1", "A0", "A2", "A0", "A1"],
        "col2": [1, 2, 3, 4, 5, 6],
    }
)

df_group = df.groupby("col1").col2.sum()
df_group

col1
A0    9
A1    8
A2    4
Name: col2, dtype: int64

In [22]:
df_group.to_frame()

      col2
col1
A0       9
A1       8
A2       4